const hospitals = [
    {
        "id" : "1",
        "이름" : "동그라미 병원",
        "전화번호" : "010-1234-5678",
        "위치" : "대구광역시 수성구",
        "분류" : "종합병원"
      },
      {
        "id" : "2",
        "이름": "세모 병원",
        "전화번호": "010-5678-1234",
        "위치": "대구광역시 달성군",
        "분류" : "내과"
      },
      {
        "id" : "3",
        "이름": "네모 병원",
        "전화번호": "010-1256-3478",
        "위치": "대구광역시 달서구",
        "분류" : "이비인후과"
      },
      {
        "id" : "4",
        "이름": "마름모 병원",
        "전화번호": "010-8765-4321",
        "위치": "대구광역시 북구",
        "분류" : "안과"
      },
      {
        "id" : "5",
        "이름": "오각형 병원",
        "전화번호": "010-0000-0000",
        "위치": "대구광역시 동구",
        "분류":"정형외과"
      },
      {
        "id" : "6",
        "이름": "육각형 병원",
        "전화번호": "010-2222-2222",
        "위치": "대구광역시 서구",
        "분류":"치과"
      },
      {
        "id" : "7",
        "이름": "칠각형 병원",
        "전화번호": "010-3333-3333",
        "위치": "대구광역시 달성군",
        "분류":"요양병원"
      },
      {
        "id" : "8",
        "이름": "팔각형 병원",
        "전화번호": "010-4444-4444",
        "위치": "대구광역시 수성구",
        "분류":"내과"
      },
      {
        "id" : "9",
        "이름": "구각형 병원",
        "전화번호": "010-5555-5555",
        "위치": "대구광역시 서구",
        "분류":"치과"
      },
      {
        "id" : "10",
        "이름": "십각형 병원",
        "전화번호": "010-6666-6666",
        "위치": "대구광역시 북구",
        "분류":"안과"
      },
      {
        "id" : "11",
        "이름": "미니 병원",
        "전화번호": "010-7777-7777",
        "위치": "대구광역시 남구",
        "분류":"종합병원"
      },
      {
        "id" : "12",
        "이름": "삐삐 병원",
        "전화번호": "010-8888-8888",
        "위치": "대구광역시 북구",
        "분류":"이비인후과"
      },
      {
        "id" : "13",
        "이름": "비숑 병원",
        "전화번호": "010-9999-9999",
        "위치": "대구광역시 남구",
        "분류":"정형외과"
      },
      {
        "id" : "14",
        "이름": "타드 병원",
        "전화번호": "010-1010-1010",
        "위치": "대구광역시 동구",
        "분류":"요양병원"
      },
      {
        "id" : "15",
        "이름": "젤리 병원",
        "전화번호": "010-1122-1122",
        "위치": "대구광역시 동구",
        "분류":"안과"
      },
      {
        "id" : "16",
        "이름": "자바 병원",
        "전화번호": "010-2233-2233",
        "위치": "대구광역시 서구",
        "분류":"내과"
      },
      {
        "id" : "17",
        "이름": "파이썬 병원",
        "전화번호": "010-2233-2233",
        "위치": "대구광역시 달성군",
        "분류":"정형외과"
      },
      {
        "id" : "18",
        "이름": "코틀린 병원",
        "전화번호": "010-2233-2233",
        "위치": "대구광역시 수성구",
        "분류":"이비인후과"
      },
      {
        "id" : "19",
        "이름": "스프링 병원",
        "전화번호": "010-2233-2233",
        "위치": "대구광역시 북구",
        "분류":"치과"
      },
      {
        "id" : "20",
        "이름": "자바스크립트 병원",
        "전화번호": "010-2233-2233",
        "위치": "대구광역시 남구",
        "분류":"안과"
      },
      {
        "id" : "21",
        "이름": "타입스크립트 병원",
        "전화번호": "010-2233-2233",
        "위치": "대구광역시 달서구",
        "분류":"외과"
      }
];
const recHospital = (req, res) => {
    const { affectedBodyPart, location } = req.body;
    
//   const hospitalsByBodyPart = hospitals.filter((hospital) =>
//   hospital[0].분류 === affectedBodyPart
// );

// const result = hospitalsByBodyPart.filter((hospital) =>
//   hospital[0].위치 === location
// );

const result1 = hospitals.filter(hospital => hospital.위치 === location);
const result2 = result1.filter(hospital => hospital.분류 === affectedBodyPart);

  
    res.status(200).json({
      message: "병원 데이터 추출",
      result2
    });
  };

module.exports = recHospital